src/Catalogs/ПравилаКонвертации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Catalog>
		<Properties>
			<Name>ПравилаКонвертации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПланОбмена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПланыОбменов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКонвертации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяТипа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбменЗапрещен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВерсииОтправителя</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Версия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>11</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВерсииПолучателя</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Версия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>11</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ПравилаКонвертации/Ext/ManagerModule.bsl
Функция ПолучитьПравила(ПланОбмена, ВерсияОтправителя, ВерсияПолучателя) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПравилаКонвертацииВерсииОтправителя.Ссылка.ИмяТипа КАК ИмяТипа,
	               |	ПравилаКонвертацииВерсииОтправителя.Ссылка.КодКонвертации КАК Код,
	               |	ПравилаКонвертацииВерсииОтправителя.Ссылка КАК Ссылка,
	               |	ПравилаКонвертацииВерсииОтправителя.Ссылка.ОбменЗапрещен КАК ОбменЗапрещен
	               |ИЗ
	               |	Справочник.ПравилаКонвертации.ВерсииОтправителя КАК ПравилаКонвертацииВерсииОтправителя
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПравилаКонвертации.ВерсииПолучателя КАК ПравилаКонвертацииВерсииПолучателя
	               |		ПО ПравилаКонвертацииВерсииОтправителя.Ссылка = ПравилаКонвертацииВерсииПолучателя.Ссылка
	               |ГДЕ
	               |	ПравилаКонвертацииВерсииОтправителя.Версия = &ВерсияОтправителя
	               |	И ПравилаКонвертацииВерсииПолучателя.Версия = &ВерсияПолучателя
	               |	И ПравилаКонвертацииВерсииОтправителя.Ссылка.ПланОбмена = &ПланОбмена
	               |	И ПравилаКонвертацииВерсииПолучателя.Ссылка.ПланОбмена = &ПланОбмена
	               |	И НЕ ПравилаКонвертацииВерсииОтправителя.Ссылка.ПометкаУдаления
	               |	И НЕ ПравилаКонвертацииВерсииПолучателя.Ссылка.ПометкаУдаления";
	Запрос.УстановитьПараметр("ПланОбмена", ПланОбмена.Ссылка);
	Запрос.УстановитьПараметр("ВерсияОтправителя", ВерсияОтправителя);
	Запрос.УстановитьПараметр("ВерсияПолучателя", ВерсияПолучателя);
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции
